----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
       BatchNorm2d-2         [-1, 64, 224, 224]             128
              GELU-3         [-1, 64, 224, 224]               0
         Cnn_block-4         [-1, 64, 224, 224]               0
            Conv2d-5         [-1, 64, 224, 224]          36,928
       BatchNorm2d-6         [-1, 64, 224, 224]             128
              GELU-7         [-1, 64, 224, 224]               0
         Cnn_block-8         [-1, 64, 224, 224]               0
         MaxPool2d-9         [-1, 64, 112, 112]               0
           Conv2d-10        [-1, 128, 112, 112]          73,856
      BatchNorm2d-11        [-1, 128, 112, 112]             256
             GELU-12        [-1, 128, 112, 112]               0
        Cnn_block-13        [-1, 128, 112, 112]               0
           Conv2d-14        [-1, 128, 112, 112]         147,584
      BatchNorm2d-15        [-1, 128, 112, 112]             256
             GELU-16        [-1, 128, 112, 112]               0
        Cnn_block-17        [-1, 128, 112, 112]               0
        MaxPool2d-18          [-1, 128, 56, 56]               0
           Conv2d-19          [-1, 256, 56, 56]         295,168
      BatchNorm2d-20          [-1, 256, 56, 56]             512
             GELU-21          [-1, 256, 56, 56]               0
        Cnn_block-22          [-1, 256, 56, 56]               0
           Conv2d-23          [-1, 256, 56, 56]         590,080
      BatchNorm2d-24          [-1, 256, 56, 56]             512
             GELU-25          [-1, 256, 56, 56]               0
        Cnn_block-26          [-1, 256, 56, 56]               0
           Conv2d-27          [-1, 256, 56, 56]         590,080
      BatchNorm2d-28          [-1, 256, 56, 56]             512
             GELU-29          [-1, 256, 56, 56]               0
        Cnn_block-30          [-1, 256, 56, 56]               0
           Conv2d-31          [-1, 256, 56, 56]         590,080
      BatchNorm2d-32          [-1, 256, 56, 56]             512
             GELU-33          [-1, 256, 56, 56]               0
        Cnn_block-34          [-1, 256, 56, 56]               0
        MaxPool2d-35          [-1, 256, 28, 28]               0
           Conv2d-36          [-1, 512, 28, 28]       1,180,160
      BatchNorm2d-37          [-1, 512, 28, 28]           1,024
             GELU-38          [-1, 512, 28, 28]               0
        Cnn_block-39          [-1, 512, 28, 28]               0
           Conv2d-40          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-41          [-1, 512, 28, 28]           1,024
             GELU-42          [-1, 512, 28, 28]               0
        Cnn_block-43          [-1, 512, 28, 28]               0
           Conv2d-44          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-45          [-1, 512, 28, 28]           1,024
             GELU-46          [-1, 512, 28, 28]               0
        Cnn_block-47          [-1, 512, 28, 28]               0
           Conv2d-48          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-49          [-1, 512, 28, 28]           1,024
             GELU-50          [-1, 512, 28, 28]               0
        Cnn_block-51          [-1, 512, 28, 28]               0
        MaxPool2d-52          [-1, 512, 14, 14]               0
           Conv2d-53          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-54          [-1, 512, 14, 14]           1,024
             GELU-55          [-1, 512, 14, 14]               0
        Cnn_block-56          [-1, 512, 14, 14]               0
           Conv2d-57          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-58          [-1, 512, 14, 14]           1,024
             GELU-59          [-1, 512, 14, 14]               0
        Cnn_block-60          [-1, 512, 14, 14]               0
           Conv2d-61          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-62          [-1, 512, 14, 14]           1,024
             GELU-63          [-1, 512, 14, 14]               0
        Cnn_block-64          [-1, 512, 14, 14]               0
           Conv2d-65          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-66          [-1, 512, 14, 14]           1,024
             GELU-67          [-1, 512, 14, 14]               0
        Cnn_block-68          [-1, 512, 14, 14]               0
        MaxPool2d-69            [-1, 512, 7, 7]               0
  VGG19_etraction-70            [-1, 512, 7, 7]               0
           Linear-71                 [-1, 4096]     102,764,544
          Dropout-72                 [-1, 4096]               0
             GELU-73                 [-1, 4096]               0
  Fully_connected-74                 [-1, 4096]               0
           Linear-75                 [-1, 1000]       4,097,000
          Dropout-76                 [-1, 1000]               0
             GELU-77                 [-1, 1000]               0
  Fully_connected-78                 [-1, 1000]               0
           Linear-79                   [-1, 10]          10,010
================================================================
Total params: 126,906,946
Trainable params: 126,906,946
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 465.27
Params size (MB): 484.11
Estimated Total Size (MB): 949.96
----------------------------------------------------------------
